user/tutorials/Nike/dropletEvap_1d_fine/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 10e-6;

vertices
(
    (0 0 0) //0  5deg
    (5 0 0) //1
    (4.980973490458728 0.4357787137382908 0) //2
    //(0 10 0)
    //(0 0 10)
    (4.980973490458728 0 0.4357787137382908) //3
    (4.962019382530521 0.4341204441673258 0.4341204441673258) //4
    //(0 10 10)
);

blocks
(
    hex (0 1 2 0 0 3 4 0) (256 1 1) simpleGrading (1 1 1) //block 1
);

edges
(
    arc 1 2 (0 5 0)
    arc 3 4 (0 4.980973490458728 0.4357787137382908)
    arc 1 3 (0 0 5)
    arc 2 4 (0 0 5)
);

boundary
(
    wall
    {
        type wall;
        faces
        (
            (0 2 1 0)
            (0 1 3 0)
            (0 4 2 0)
            (0 3 4 0)
        );
    }
    outlet
    {
        type            patch;
        faces           ((1 2 4 3));
    }  
);


mergePatchPairs
(
);

// ************************************************************************* //
